In [1]:
import pandas as pd

### Q1.Create a dataframe with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3

In [2]:
data = [[1, 'Aviral', 'M', 23, 25, 26], [2, 'Avi', 'F', 45, 34, 22], [3, 'Anukriti', 'F', 12, 49, 39], [4, 'Chestha', 'F', 33, 34, 35],
           [5, 'Dinesh', 'M', 45, 48, 41], [6, 'Palak', 'F', 40, 11, 13], [7, 'Rishabh', 'M', 39, 40, 41],
            [8, 'Sourabh', 'M', 23, 28, 29], [9, 'Naman', 'M', 22, 22, 22], [10, 'Vivek', 'M', 50, 49, 48]] 
df = pd.DataFrame(data, columns = ['RollNo', 'Name', 'Gender', 'Marks1', 'Marks2', 'Marks3'])
df

   RollNo      Name Gender  Marks1  Marks2  Marks3
0       1    Aviral      M      23      25      26
1       2       Avi      F      45      34      22
2       3  Anukriti      F      12      49      39
3       4   Chestha      F      33      34      35
4       5    Dinesh      M      45      48      41
5       6     Palak      F      40      11      13
6       7   Rishabh      M      39      40      41
7       8   Sourabh      M      23      28      29
8       9     Naman      M      22      22      22
9      10     Vivek      M      50      49      48

### Q2.Create a new column with total marks

In [3]:
totalMarks = df[['Marks1', 'Marks2', 'Marks3']].sum(axis = 1)
df['Total Marks'] = totalMarks
df

   RollNo      Name Gender  Marks1  Marks2  Marks3  Total Marks
0       1    Aviral      M      23      25      26           74
1       2       Avi      F      45      34      22          101
2       3  Anukriti      F      12      49      39          100
3       4   Chestha      F      33      34      35          102
4       5    Dinesh      M      45      48      41          134
5       6     Palak      F      40      11      13           64
6       7   Rishabh      M      39      40      41          120
7       8   Sourabh      M      23      28      29           80
8       9     Naman      M      22      22      22           66
9      10     Vivek      M      50      49      48          147

### Q3.Find the lowest marks in Marks1

In [4]:
lowestMarks1 = df['Marks1'].min()
print("Lowest marsk in Marks1 is: ", lowestMarks1)

Lowest marsk in Marks1 is:  12

### Q4.Find the highest marks in Marks2

In [5]:
highestMarks2 = df['Marks2'].max()
print("Highest marks in Marks2 is: ", highestMarks2)

Highest marks in Marks2 is:  49

### Q5.Find the average marks in Marks3

In [6]:
avgMarks3 = df['Marks3'].mean()
print("Average marks in Marks3: ", avgMarks3)

Average marks in Marks3:  31.6

### Q6.Find the student name with highest average

In [7]:
highestAvgId = int(df[['Marks1', 'Marks2', 'Marks3']].mean(axis = 1).idxmax())
highAvgStdName = df.iloc[highestAvgId, 1]
print("Student with highest average is: ", highAvgStdName)

Student with highest average is:  Vivek

### Q7.Find how many students failed in Marks2

In [8]:
failedInMarks2 = df[df['Marks2'] < 40]
print("Number of students failed in Marks2 are: ", failedInMarks2['Name'].count())

Number of students failed in Marks2 are:  6